mo_orange.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:comm3="http://www.csapi.org/schema/parlayx/common/v3_1"
	xmlns:sms7="http://www.csapi.org/schema/parlayx/sms/notification/v3_1/local">
	<SOAP-ENV:Header>
		<comm3:NotifySOAPHeader>
			<spId>36</spId>
		</comm3:NotifySOAPHeader>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
		<sms7:notifySmsDeliveryReceipt>
			<sms7:correlator></sms7:correlator>
			<sms7:deliveryStatus>
				<address>tel:254776165280</address>
				<deliveryStatus>DeliveredToTerminal</deliveryStatus>
			</sms7:deliveryStatus>
		</sms7:notifySmsDeliveryReceipt>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>